---
kind: enumMember
id: F:Autodesk.Revit.DB.Visual.WallpaintFinishType.Semigloss
enum: Autodesk.Revit.DB.Visual.WallpaintFinishType
source: html/378d0061-9fcf-7b1b-b4c7-c00744d727e6.htm
---
# Autodesk.Revit.DB.Visual.WallpaintFinishType.Semigloss